import os

from pygments.lexer import words

base_dir = os.path.dirname(__file__)
file_path = os.path.join(base_dir, "代码生成的新文件", "write.txt")

str1=""""
name,date,money,type,remarks
周杰轮,2022-01-01,100000,消费,正式
周杰轮,2022-01-02,300000,收入,正式
周杰轮,2022-01-03,100000,消费,测试
林俊节,2022-01-01,300000,收入,正式
林俊节,2022-01-02,100000,消费,测试
林俊节,2022-01-03,100000,消费,正式
林俊节,2022-01-04,100000,消费,测试
林俊节,2022-01-05,500000,收入,正式
张学油,2022-01-01,100000,消费,正式
张学油,2022-01-02,500000,收入,正式
张学油,2022-01-03,900000,收入,测试
王力鸿,2022-01-01,500000,消费,正式
王力鸿,2022-01-02,300000,消费,测试
王力鸿,2022-01-03,950000,收入,正式
刘德滑,2022-01-01,300000,消费,测试
刘德滑,2022-01-02,100000,消费,正式
刘德滑,2022-01-03,300000,消费,正式
"""
def test01():
    f = open(file_path, "w", encoding="utf-8")
    f.write("dsff")
    f.flush()
def test02():
    with open("bill.txt", "a", encoding="utf-8") as f:
        f.write(str1)

    print("文件已处理完毕（若不存在已自动创建）")

if __name__ == '__main__':
    test02()